{
"DOP":{"type":"datetime", "details":"Date of procedure"},
"ICU":{"type":"numerical", "details":"hours in ICU"},
"VENT":{"type":"numerical","details":"hours intubated"},
"opno":{"type":"numerical","details":"operation number during inpatient stay"},
"NewMort3":{"type":"categorical","details":"NewMort3 is an automated field that refers to whether a patient died within 30 days of the indexed procedure OR within hospital (both prior to and after 30 days). The fields used for this are Mort30 and Dischar."},
"TP":{"type":"categorical","details":"TP = 1 is a code for isolated CABG procedures TP = 2 is for isolated valve procedures TP = 3 is a combination of CABG and valve procedures TP = 4 is for other procedures"},
"Redo":{"type":"categorical","details":"redo operation"},
"PROCNO":{"type":"numerical","details":"Record the sequential number of cardiac operation(s) performed on this patient on the day of the index operation."},
"AGE":{"type":"numerical","details":"age"},
"Sex":{"type":"categorical","details":"biological sex"},
"Race1":{"type":"categorical","details":"indigenous status"},
"DOSA":{"type":"categorical","details":"elective day of surgery"},
"DOD":{"type":"datetime","details":"date of discharge"},
"Insur":{"type":"categorical","details":"indicate the patient’s insurance status."},
"SMO_H":{"type":"categorical","details":"history of smoking"},
"SMO_C":{"type":"categorical","details":"current smoker"},
"DB":{"type":"categorical","details":"history of diabetes"},
"DB_CON":{"type":"categorical","details":"diabetes control"},
"HCHOL":{"type":"categorical","details":"history of high cholesterol"},
"PRECR":{"type":"numerical","details":"preoperative creatinine"},
"DIAL":{"type":"categorical","details":"baseline dialysis"},
"TRANS":{"type":"categorical","details":"history of renal transplant"},
"HG":{"type":"numerical","details":"preoperative haemaglobin"},
"HYT":{"type":"categorical","details":"history of hypertension"},
"CBVD":{"type":"categorical","details":"history of cerebrovascular disease"},
"CBVD_T":{"type":"categorical","details":"type of cerebrovascular disease"},
"CVA_W":{"type":"categorical","details":"If the patient suffered a cerebrovascular accident (CVA), was it recent or remote?"},
"CART":{"type":"categorical","details":"Does the result of a non-invasive/invasive carotid test indicate 50% or greater diameter stenosis"},
"PVD":{"type":"categorical","details":"Does the patient have a history of PVD characterised by aneurysmal, chronic, or acute occlusion/narrowing of the arterial lumen of the aorta or extremities"},
"LD":{"type":"categorical","details":"Does the patient have a chronic respiratory/lung disease which is characterised by any of following?"},
"LD_T":{"type":"categorical","details":"Indicate the severity of the chronic lung/respiratory disease from the list below."},
"IE":{"type":"categorical","details":"Did the patient present with valvular disease of infectious aetiology"},
"IE_T":{"type":"categorical","details":"Indicate if endocarditis is active or treated."},
"IMSRX":{"type":"categorical","details":"Was the patient on any form of immunosuppressive therapy within 30 days of the current surgery"},
"MI":{"type":"categorical","details":"Has the patient been hospitalised at any time for a Myocardial Infarction (MI)"},
"MI_T":{"type":"categorical","details":"MYOCARDIAL INFARCTION – TYPE"},
"MI_W":{"type":"categorical","details":"Indicate the time period between onset of the last documented myocardial infarction and surgery"},
"CCS":{"type":"categorical","details":"Indicate the patient’s highest Canadian Cardiovascular Society (CCS) classification "},
"ANGRXG":{"type":"categorical","details":"Did the patient receive IV GTN to treat angina on the day of surgery?"},
"ANGRXH":{"type":"categorical","details":"Did the patient receive IV Heparin to treat angina ≤12 hours prior to surgery?"},
"ANGRXC":{"type":"categorical","details":"id the patient receive full dose Heparinoids to treat angina ≤24 hours prior to surgery?"},
"CHF":{"type":"categorical","details":"Does the patient have a history of congestive heart failure (CHF) diagnosed by a physician"},
"CHF_C":{"type":"categorical","details":"During the current admission, was the patient diagnosed with CHF or was the management of CHF changed due to deterioration in CHF"},
"NYHA":{"type":"categorical","details":"Indicate the patient’s highest level of dyspnoea as classified by the New York Heart Association"},
"SHOCK":{"type":"categorical","details":"Was the patient in cardiogenic shock at the time of procedure?"},
"RESUS":{"type":"categorical","details":"Did the patient require either of the following within one hour of the start of the operative procedure? - CPR or treatment for shock"},
"ARRT":{"type":"categorical","details":"Was there a clinically documented pre-operative arrhythmia present?"},
"ARRT_A":{"type":"categorical","details":"Was the clinically documented arrhythmia an atrial fibrillation or flutter requiring treatment?"},
"ARRT_AT":{"type":"categorical","details":"Indicate the type of atrial fibrillation/flutter"},
"ARRT_H":{"type":"categorical","details":"Was the clinically documented arrhythmia a complete heart block (AV dissociation)?"},
"ARRT_V":{"type":"categorical","details":"Was the clinically documented arrhythmia sustained or recurrent ventricular tachycardia or ventricular fibrillation requiring cardioversion and/or IV medication?"},
"ARRT_O":{"type":"categorical","details":"Was the clinically documented arrhythmia an ‘other’ arrhythmia, i.e. not one documented in variables"},
"PACE":{"type":"categorical","details":"Indicate whether a previous permanent pacemaker was placed any time prior to this surgical procedure."},
"MEDIN":{"type":"categorical","details":"Did the patient receive inotropes on the day of surgery for haemodynamic support"},
"MEDNI":{"type":"categorical","details":"Did the patient receive IV nitrates on the day of surgery?"},
"MEDAC":{"type":"categorical","details":"Did the patient receive warfarin/heparin/ low molecular weight heparinoid/thrombin inhibitors, and/or factor Xa inhibitors ≤ 24 hours prior to surgery?"},
"MEDST":{"type":"categorical","details":"Did the patient receive systemic steroids within 24 hours of surgery?"},
"MED_ASP":{"type":"categorical","details":"Did the patient take aspirin within seven days prior to surgery?"},
"MED_ASP_W":{"type":"numerical","details":"Enter number of days since the time the last documented aspirin was taken."},
"MED_CLOP":{"type":"categorical","details":"Did the patient take thienopyridine within seven days prior to surgery?"},
"MED_TICA":{"type":"categorical","details":"Did the patient take Ticagrelor within seven days prior to surgery?"},
"MED_AGG":{"type":"categorical","details":"Did the patient take Tirofiban or Eptifibatide (short-acting glycoprotein IIb/IIIa inhibitor) within seven days prior to surgery?"},
"MED_ABCI":{"type":"categorical","details":"Did the patient receive abciximab (long acting glycoprotein IIb/IIIa inhibitor) within seven days prior to surgery?"},
"MED_OTH":{"type":"categorical","details":"Did the patient receive any other antiplatelet therapy (apart from those listed in variables 50.0-54.0) within seven days prior to surgery?"},
"POP":{"type":"categorical","details":"Does the patient have any history of previous cardiothoracic intervention (surgical or percutaneous) prior to the index operation (including prior procedures performed in the current admission)?"},
"PTAVR":{"type":"categorical","details":"Was a transcatheter aortic valve replacement (TAVR) procedure performed at any time prior to the index operation (including those performed in the current admission)?"},
"PTCA":{"type":"categorical","details":"Was a transluminal coronary angioplasty/coronary atherectomy and/or coronary stent procedure performed at any time prior to the index operation (including prior procedures performed in the current admission)?"},
"PTCA_ADM":{"type":"categorical","details":"Was a PTCA/stent procedure performed prior to the current admission (remote) or during the current admission (this admission)?"},
"PTCA_H":{"type":"categorical","details":"Record the time interval between PTCA/atherectomy/stent and the current surgical procedure. "},
"LAAO":{"type":"categorical","details":"Has the patient undergone occlusion of the atrial appendage prior to the index operation (including those in the current admission) "},
"HTM":{"type":"numerical","details":"explain"},
"WKG":{"type":"numerical","details":"explain"},
"CATH":{"type":"categorical","details":"Has the patient had cardiac catheterisation (angiography)?"},
"EF":{"type":"numerical","details":"Record the percentage of blood emptied from the left ventricle at the end of the contraction."},
"EF_EST":{"type":"categorical","details":"If nuclear scan, echocardiogram, or left ventriculogram did not yield a digital EF%, review the study and provide an estimate. "},
"LMD":{"type":"categorical","details":"Does the patient have any stenosis that involves any part of the left main? "},
"DISVES":{"type":"categorical","details":"Indicate the number of (the three) major coronary systems (LAD system, Circumflex system, Right Coronary system)"},
"BMI":{"type":"numerical","details":"Body Mass Index"},
"BSA":{"type":"numerical","details":"Body Surface Area"},
"eGFR_Corrected":{"type":"numerical","details":"Estimated glomerular filtration rate"},
"STAT":{"type":"categorical","details":"Indicate the clinical status of the patient prior to entering the operating room from the table below"},
"UOR":{"type":"categorical","details":"Indicate why the patient’s clinical status was ‘urgent’:"},
"DTCATH":{"type":"categorical","details":"Did the patient require direct transfer to theatre for ongoing management as a result of a cardiac catheter lab event?"},
"CCAB":{"type":"categorical","details":"Is the index operation a Coronary Artery Bypass Graft (CABG)?"},
"CVLV":{"type":"categorical","details":"Is the index operation a Valve Procedure"},
"COTH":{"type":"categorical","details":"Is the index operation for a cardiac procedure that is not a CABG or Valve?"},
"CT":{"type":"categorical","details":"Is the index operation for cardiac transplant?"},
"OTHCON":{"type":"categorical","details":"Is the index operation for a congenital complication not otherwise specified?"},
"MIN":{"type":"categorical","details":"Was a non-standard (sternotomy or thoracotomy) incision used for the cardiac procedure (on- or off- pump)?"},
"ROBOT":{"type":"categorical","details":"Was the procedure performed with the assistance of a robot (e.g. Da Vinci, AESOP)?"},
"CPB":{"type":"categorical","details":"Did the index operation use cardiopulmonary bypass (i.e. was the operation performed on-pump)?"},
"CPLEG":{"type":"categorical","details":"Was cardioplegia used in the index operation?"},
"CPLEG_T":{"type":"categorical","details":"What type of cardioplegia was used?"},
"CCT":{"type":"numerical","details":"Where the index operation was performed on-pump, indicate the total number of minutes the aorta was completely cross-clamped and the heart was ischaemic during bypass."},
"PERF":{"type":"numerical","details":"Where the index operation was performed on-pump, indicate the total number of minutes the patient was on cardiopulmonary bypass."},
"MINHT":{"type":"numerical","details":"What was the lowest haemoglobin recorded whilst the patient was on cardiopulmonary bypass?"},
"IABP":{"type":"categorical","details":"Did the patient have an Intra-Aortic Balloon Pump (IABP) inserted at any point during the current admission?"},
"IABP_W":{"type":"categorical","details":"Where an IABP was inserted, indicate time of earliest insertion"},
"IABP_I":{"type":"categorical","details":"What was the PRIMARY reason for insertion of the IABP?"},
"ECMO":{"type":"categorical","details":"Was the patient placed on Extra-Corporeal Membrane Oxygenation (ECMO) at any time during the current admission?"},
"ECMO_W":{"type":"categorical","details":"Indicate the earliest use of ECMO in the current admission."},
"ECMO_I":{"type":"categorical","details":"Indicate the PRIMARY reason for use of ECMO."},
"VAD":{"type":"categorical","details":"Did the patient have a ventricular assist device (VAD) implanted at any point during the current admission?"},
"VAD_W":{"type":"categorical","details":"Indicate the earliest insertion of VAD during the current admission."},
"VAD_I":{"type":"categorical","details":"Indicate the PRIMARY reason for inserting a VAD."},
"ANTIFIB":{"type":"categorical","details":"Was an antifibrinolytic agent used intra-operatively during the index operation?"},
"ANTIFIB_T":{"type":"categorical","details":"INTRA-OPERATIVE ANTIFIBRINOLYTIC USE – TYPE"},
"RBC":{"type":"categorical","details":"Were allogeneic red blood cells (RBC) transfused during the intra-operative or post-operative period?"},
"RBCUnit":{"type":"numerical","details":"Enter the total number of RBC units transfused."},
"NRBC":{"type":"categorical","details":"During the index admission, were blood products other than RBC (e.g. FFP and Platelets) transfused?"},
"PlateUnit":{"type":"numerical","details":"Indicate the number of platelet units transfused."},
"NovoUnit":{"type":"numerical","details":"Indicate milligrams of Novo 7 used."},
"CryoUnit":{"type":"numerical","details":"Indicate the number of Cryoprecipitate units used."},
"FFPUnit":{"type":"numerical","details":"Indicate the number of Fresh Frozen Plasma (FFP) units used."},
"REICU":{"type":"categorical","details":"During the index operation, was the patient readmitted to ICU following the initial discharge from ICU"},
"REINT":{"type":"categorical","details":"During the index admission, was the patient was re-intubated after the initial extubation?"},
"DRAIN_4":{"type":"numerical","details":"Record the fluid loss (in millilitres) from the pericardial/mediastinal (intercostal catheter) drains in the first 4 hours post-operation."},
"RTT":{"type":"categorical","details":"explain"},
"ROSI":{"type":"categorical","details":"Did the patient return to theatre for infection of sternal bone muscle and/or mediastinum?"},
"NRF":{"type":"categorical","details":"Was there acute post-operative renal insufficiency "},
"HAEMOFIL":{"type":"categorical","details":"Did the patient undergo acute institution of haemofiltration (or dialysis) as treatment for new renal failure?"},
"POSTCR":{"type":"numerical","details":"Record the highest serum creatinine level recorded after surgery."},
"POMI":{"type":"categorical","details":"Was a peri-/post- operative myocardial infarction (MI) diagnosed "},
"POCS":{"type":"categorical","details":"Did the patient suffer peri-/ post- operative cardiogenic shock?"},
"POSTHG":{"type":"numerical","details":"Record the lowest haemoglobin recorded post-operatively."},
"CIUSE":{"type":"categorical","details":"Was an inotrope used to maintain cardiac output or SVR for longer than 4 hours post-operatively?"},
"IULOWOUT":{"type":"categorical","details":"Were inotrope(s) used for low cardiac output syndrome longer than four hours post-operatively "},
"IULowSVR":{"type":"categorical","details":"Was a vasopressor used for low systemic vascular resistance syndrome for longer than 4 hours post- operatively"},
"NARRT":{"type":"categorical","details":"Did any new form of cardiac arrhythmia occur that required treatment?"},
"HB":{"type":"categorical","details":"Did the patient develop new heart block requiring the implantation of a permanent pacemaker prior to discharge?"},
"BA":{"type":"categorical","details":"Did the patient develop a new bradyarrhythmia not otherwise specified requiring the implantation of permanent pacemaker prior to discharge?"},
"CA":{"type":"categorical","details":"Did the patient have a new cardiac arrest documented"},
"AFIB":{"type":"categorical","details":"Was there a new onset of atrial fibrillation/flutter (AF) requiring treatment?"},
"NARRTV":{"type":"categorical","details":"Did any new form of ventricular tachycardia (greater than 6 beat run) occur that required treatment?"},
"CVA_P":{"type":"categorical","details":"Did the patient experience a stroke or new central neurologic deficit (persisting for >72 hours) peri- or post-operatively?"},
"CVA_T":{"type":"categorical","details":"Did the patient experience a new transient central neurologic deficit that was resolved completely within 72 hours (TIA/RIND)?"},
"COMA":{"type":"categorical","details":"Did the patient have post-operative coma of neurologic aetiology lasting at least 24 hours?"},
"PUEMB":{"type":"categorical","details":"Did the patient have a new pulmonary embolism diagnosed by study such as ventilation/perfusion (V/Q) scan or angiogram?"},
"PUPNU":{"type":"categorical","details":"Was pneumonia diagnosed post-operatively by one of the following:"},
"INFDS":{"type":"categorical","details":"Did the patient develop infection of sternal bone, muscle and/or mediastinum?"},
"SWI":{"type":"categorical","details":"Did the patient develop an infection involving the skin and subcutaneous tissues of the incision occurring within 30-days post-operation?"},
"DOWI":{"type":"categorical","details":"Did the patient develop an infection involving deep soft tissues "},
"INFTH":{"type":"categorical","details":"Did the patient develop an infection involving a thoracotomy or parasternal site?"},
"INFSP":{"type":"categorical","details":"Did the patient develop septicaemia defined by positive blood cultures "},
"NAODS":{"type":"categorical","details":"Did dissection occur in any part of the aorta?"},
"LISCH":{"type":"categorical","details":"Was there any evidence of limb ischaemia?"},
"ACOAG":{"type":"categorical","details":"Did the patient develop any bleeding, haemorrhage, and/or embolic events related to anticoagulant therapy?"},
"GIT":{"type":"categorical","details":"Did the patient develop any GIT complication post-operatively"},
"MSF":{"type":"categorical","details":"Did the patient develop multi-system failure post-operatively?"},
"DISCHAR":{"type":"categorical","details":"Indicate from the list the location where the patient was discharged to"},
"Final_Deathdate":{"type":"datetime","details":"Indicate the date of death if the patient:"},
"MORT_R":{"type":"categorical","details":"Indicate the PRIMARY cause of death, i.e. the first significant event which ultimately led to death."},
"DEATH_CODE":{"type":"categorical","details":"Indicate the PRIMARY cause of death, i.e. the first significant event which ultimately led to death from NDI."},
"WITHDRAW":{"type":"categorical","details":"Did the patient who was aware of the consequences of his/her actions, elect to withdraw treatment in circumstances where they would survive if treatment had continued."}
}
